---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipePressureDropData
source: html/d9c2df4c-512f-3f0c-4c04-2f5cc5afa7d8.htm
---
# Autodesk.Revit.DB.Plumbing.PipePressureDropData

The input and output data used by external servers for calculation of the pipe pressure drop.

## Syntax (C#)
```csharp
public class PipePressureDropData : IDisposable
```

## Remarks
Roughness, Length, Flow, Diameter, Density, and Viscosity field values are input data for the calculation. ReynoldsNumber, FlowStatus, Friction, FrictionFactor, Velocity, Coefficient, and PressureDrop are output values.